/*----------------------------------------------------------------------------------
                         直方图统计中值滤波
						 暂时只支持256色图片
-----------------------------------------------------------------------------------*/
#ifndef HISTOGRAM_MEDIAN_FILTING_2010_11_17
#define HISTOGRAM_MEDIAN_FILTING_2010_11_17

#include "Histogram.h"
#include "cv.h"
#include "highgui.h"

class HistMedianFilter
{
public:
	//--------------------------------------------------------------------------------
	// 构造函数
	HistMedianFilter(void);
	HistMedianFilter(IplImage * src,int winsize,IplImage * result);
	//--------------------------------------------------------------------------------

public:
	//--------------------------------------------------------------------------------
	// 类输入模块
	void setimage(IplImage *src);
	void sethist(Histogram hist);
	void setwinsize(int winsize);
	void setresult(IplImage *result);
	//--------------------------------------------------------------------------------

	//--------------------------------------------------------------------------------
	// 中值滤波
	IplImage * HMedianFilter();
	//--------------------------------------------------------------------------------

private:
	//--------------------------------------------------------------------------------
	// 主要处理函数
	void mainprocess();

	// 根据x，y计算指定窗格的中值的索引
	int  CalMedian(int x,int y) ;
	// 处理行的加减，flag : 1 : 加 -1 : 减 
	void DealRow(int col,int row,int flag);
	// 处理列的加减，flag : 1 : 加 -1 : 减
	void DealCol(int col,int row,int flag);
	//--------------------------------------------------------------------------------
private:
	//--------------------------------------------------------------------------------
	// 成员变量
	IplImage * m_src,* m_result;  // 待滤波图片
	Histogram m_hist;   // 直方图
	int m_winsize;     // 窗格大小
	//--------------------------------------------------------------------------------
};

#endif;