/*-------------------------------------------------------------------------------------------------------
						直方图
						256色图片
--------------------------------------------------------------------------------------------------------*/

#ifndef HISTOGRAM_256_2010_11_17
#define HISTOGRAM_256_2010_11_17

class Histogram
{
public:
	//------------------------------------------------------------------------------------
	// 构造
	Histogram(void);
	Histogram(const Histogram & hist);
	//------------------------------------------------------------------------------------

public:
	//------------------------------------------------------------------------------------
	// 得到指定索引的值
	int getNth(int n) const;
	// 初始化
	void setzero();
	// 等法重载
	Histogram & operator = (Histogram & hist);
	// 加法重载
	Histogram  operator + (const Histogram & hist);
	// 减法重载
	Histogram  operator - (const Histogram & hist);
	// 得到直方图中第n大的值
	int GetValueSN(int n);
	// 刷新直方图
	void flush(int i,int flag);
	// 刷新直方图,一次加或者减去n
	void flushn(int i,int n,int flag);
	//------------------------------------------------------------------------------------
private:
	//------------------------------------------------------------------------------------
	//  成员变量
	int m_h[256];
	//------------------------------------------------------------------------------------
};

#endif